{
  "Zeller's Congruence Calculator | Find Day of the Week for Any Date": "Calculadora de Congruencia de Zeller | Encuentra el Día de la Semana para Cualquier Fecha",
  "📅 Zeller's Congruence Day of the Week Calculator": "📅 Calculadora del Día de la Semana con Congruencia de Zeller",
  "Discover the exact day of the week for any date. Our tool uses Zeller's Congruence for precise calculations, including the complex Gregorian calendar transition of 1582.": "Descubre el día exacto de la semana para cualquier fecha. Nuestra herramienta utiliza la Congruencia de Zeller para cálculos precisos, incluida la compleja transición del calendario gregoriano de 1582.",
  "Find Day": "Encontrar Día",
  "🧮 Zeller’s Congruence Explained": "🧮 Explicación de la Congruencia de Zeller",
  "<b>Zeller’s Congruence</b> is a brilliant mathematical formula used to determine the day of the week for any date. The version used here is optimized for the Gregorian calendar.": "La <b>Congruencia de Zeller</b> es una brillante fórmula matemática utilizada para determinar el día de la semana para cualquier fecha. La versión utilizada aquí está optimizada para el calendario gregoriano.",
  "Or": "O",
  " = The day of the week (0 = Saturday, 1 = Sunday, ..., 6 = Friday)": " = El día de la semana (0 = Sábado, 1 = Domingo, ..., 6 = Viernes)",
  " = The day of the month": " = El día del mes",
  " = The month (3 = March, ..., 12 = December). For Jan &amp; Feb, m is 13 &amp; 14 of the <i>previous</i> year.": " = El mes (3 = Marzo, ..., 12 = Diciembre). Para Ene y Feb, m es 13 y 14 del año <i>anterior</i>.",
  " = The year of the century (<code>year % 100</code>)": " = El año del siglo (<code>año % 100</code>)",
  " = The zero-based century (<code>Math.floor(year / 100)</code>)": " = El siglo basado en cero (<code>Math.floor(año / 100)</code>)",
  "Historical Adjustment Note:": "Nota de Ajuste Histórico:",
  "The Gregorian calendar was adopted in October 1582, which involved skipping 10 days (from October 5th to 14th) to realign the calendar with the seasons. This app correctly identifies these non-existent dates.": "El calendario gregoriano fue adoptado en octubre de 1582, lo que implicó saltarse 10 días (del 5 al 14 de octubre) para realinear el calendario con las estaciones. Esta aplicación identifica correctamente estas fechas inexistentes.",
  "🤔 Frequently Asked Questions (FAQ)": "🤔 Preguntas Frecuentes (FAQ)",
  "What is Zeller’s Congruence?": "¿Qué es la Congruencia de Zeller?",
  "Zeller's Congruence is a mathematical algorithm developed by Christian Zeller to calculate the day of the week for any given date in the Gregorian or Julian calendars.": "La Congruencia de Zeller es un algoritmo matemático desarrollado por Christian Zeller para calcular el día de la semana para cualquier fecha en los calendarios gregoriano o juliano.",
  "Why are January and February treated as months 13 and 14 of the previous year?": "¿Por qué enero y febrero se tratan como los meses 13 y 14 del año anterior?",
  "This adjustment simplifies the leap year calculation. By treating January and February as the end of the previous year, the leap day (February 29th) is always the last day of the calculation year, which makes the formula consistent.": "Este ajuste simplifica el cálculo del año bisiesto. Al tratar enero y febrero como el final del año anterior, el día bisiesto (29 de febrero) es siempre el último día del año de cálculo, lo que hace que la fórmula sea consistente.",
  "Is this calculator accurate?": "¿Es precisa esta calculadora?",
  "Yes, this calculator is highly accurate for any date since the adoption of the Gregorian calendar (October 15, 1582). It correctly handles the 10-day skip implemented during the calendar reform.": "Sí, esta calculadora es muy precisa para cualquier fecha desde la adopción del calendario gregoriano (15 de octubre de 1582). Maneja correctamente el salto de 10 días implementado durante la reforma del calendario.",
  "Day Finder": "Buscador de Días",
  "Developed by Mamedul Islam": "Desarrollado por Mamedul Islam",
  "⚠️ Please select a valid date.": "⚠️ Por favor, seleccione una fecha válida.",
  "⚠️ These dates (Oct 5-14, 1582) do not exist due to the Gregorian calendar reform.": "⚠️ Estas fechas (5-14 de octubre de 1582) no existen debido a la reforma del calendario gregoriano.",
  "⚠️ This calculator is accurate for dates on or after October 15, 1582.": "⚠️ Esta calculadora es precisa para fechas a partir del 15 de octubre de 1582.",
  "%1$s <b>%2$s</b> is a <span style=\"color:var(--primary)\">%3$s</span>": "%1$s <b>%2$s</b> es un <span style=\"color:var(--primary)\">%3$s</span>",
  "%1$s <b>%2$s</b> was a <span style=\"color:var(--primary)\">%3$s</span>": "%1$s <b>%2$s</b> fue un <span style=\"color:var(--primary)\">%3$s</span>",
  "%1$s <b>%2$s</b> will be a <span style=\"color:var(--primary)\">%3$s</span>": "%1$s <b>%2$s</b> será un <span style=\"color:var(--primary)\">%3$s</span>",
  "Saturday": "Sábado",
  "Sunday": "Domingo",
  "Monday": "Lunes",
  "Tuesday": "Martes",
  "Wednesday": "Miércoles",
  "Thursday": "Jueves",
  "Friday": "Viernes",
  "0": "٠",
  "1": "١",
  "2": "٢",
  "3": "٣",
  "4": "٤",
  "5": "٥",
  "6": "٦",
  "7": "٧",
  "8": "٨",
  "9": "٩",
  "English": "Inglés",
  "Mandarin Chinese": "Chino Mandarín",
  "Hindi": "Hindi",
  "Spanish": "Español",
  "French": "Francés",
  "Arabic": "Árabe",
  "Bengali (Bangla)": "Bengalí (Bangla)",
  "Portuguese": "Portugués",
  "Russian": "Ruso",
  "Urdu": "Urdu",
  "Select Language": "Seleccione el Idioma"
}
