{
  "Zeller's Congruence Calculator | Find Day of the Week for Any Date": "Calculateur de Congruence de Zeller | Trouver le Jour de la Semaine pour N'importe Quelle Date",
  "📅 Zeller's Congruence Day of the Week Calculator": "📅 Calculateur de Jour de la Semaine par Congruence de Zeller",
  "Discover the exact day of the week for any date. Our tool uses Zeller's Congruence for precise calculations, including the complex Gregorian calendar transition of 1582.": "Découvrez le jour exact de la semaine pour n'importe quelle date. Notre outil utilise la Congruence de Zeller pour des calculs précis, y compris la transition complexe du calendrier grégorien de 1582.",
  "Find Day": "Trouver le Jour",
  "🧮 Zeller’s Congruence Explained": "🧮 Explication de la Congruence de Zeller",
  "<b>Zeller’s Congruence</b> is a brilliant mathematical formula used to determine the day of the week for any date. The version used here is optimized for the Gregorian calendar.": "La <b>Congruence de Zeller</b> est une formule mathématique brillante utilisée pour déterminer le jour de la semaine pour n'importe quelle date. La version utilisée ici est optimisée pour le calendrier grégorien.",
  "Or": "Ou",
  " = The day of the week (0 = Saturday, 1 = Sunday, ..., 6 = Friday)": " = Le jour de la semaine (0 = Samedi, 1 = Dimanche, ..., 6 = Vendredi)",
  " = The day of the month": " = Le jour du mois",
  " = The month (3 = March, ..., 12 = December). For Jan &amp; Feb, m is 13 &amp; 14 of the <i>previous</i> year.": " = Le mois (3 = Mars, ..., 12 = Décembre). Pour Janv & Fév, m est 13 & 14 de l'année <i>précédente</i>.",
  " = The year of the century (<code>year % 100</code>)": " = L'année du siècle (<code>année % 100</code>)",
  " = The zero-based century (<code>Math.floor(year / 100)</code>)": " = Le siècle basé sur zéro (<code>Math.floor(année / 100)</code>)",
  "Historical Adjustment Note:": "Note d'Ajustement Historique :",
  "The Gregorian calendar was adopted in October 1582, which involved skipping 10 days (from October 5th to 14th) to realign the calendar with the seasons. This app correctly identifies these non-existent dates.": "Le calendrier grégorien a été adopté en octobre 1582, ce qui a impliqué de sauter 10 jours (du 5 au 14 octobre) pour réaligner le calendrier avec les saisons. Cette application identifie correctement ces dates inexistantes.",
  "🤔 Frequently Asked Questions (FAQ)": "🤔 Foire Aux Questions (FAQ)",
  "What is Zeller’s Congruence?": "Qu'est-ce que la Congruence de Zeller ?",
  "Zeller's Congruence is a mathematical algorithm developed by Christian Zeller to calculate the day of the week for any given date in the Gregorian or Julian calendars.": "La Congruence de Zeller est un algorithme mathématique développé par Christian Zeller pour calculer le jour de la semaine pour une date donnée dans les calendriers grégorien ou julien.",
  "Why are January and February treated as months 13 and 14 of the previous year?": "Pourquoi janvier et février sont-ils traités comme les 13ème et 14ème mois de l'année précédente ?",
  "This adjustment simplifies the leap year calculation. By treating January and February as the end of the previous year, the leap day (February 29th) is always the last day of the calculation year, which makes the formula consistent.": "Cet ajustement simplifie le calcul de l'année bissextile. En traitant janvier et février comme la fin de l'année précédente, le jour bissextile (29 février) est toujours le dernier jour de l'année de calcul, ce qui rend la formule cohérente.",
  "Is this calculator accurate?": "Ce calculateur est-il précis ?",
  "Yes, this calculator is highly accurate for any date since the adoption of the Gregorian calendar (October 15, 1582). It correctly handles the 10-day skip implemented during the calendar reform.": "Oui, ce calculateur est très précis pour toute date depuis l'adoption du calendrier grégorien (15 octobre 1582). Il gère correctement le saut de 10 jours mis en œuvre lors de la réforme du calendrier.",
  "Day Finder": "Chercheur de Jour",
  "Developed by Mamedul Islam": "Développé par Mamedul Islam",
  "⚠️ Please select a valid date.": "⚠️ Veuillez sélectionner une date valide.",
  "⚠️ These dates (Oct 5-14, 1582) do not exist due to the Gregorian calendar reform.": "⚠️ Ces dates (5-14 octobre 1582) n'existent pas en raison de la réforme du calendrier grégorien.",
  "⚠️ This calculator is accurate for dates on or after October 15, 1582.": "⚠️ Ce calculateur est précis pour les dates à partir du 15 octobre 1582.",
  "%1$s <b>%2$s</b> is a <span style=\"color:var(--primary)\">%3$s</span>": "%1$s <b>%2$s</b> est un <span style=\"color:var(--primary)\">%3$s</span>",
  "%1$s <b>%2$s</b> was a <span style=\"color:var(--primary)\">%3$s</span>": "%1$s <b>%2$s</b> était un <span style=\"color:var(--primary)\">%3$s</span>",
  "%1$s <b>%2$s</b> will be a <span style=\"color:var(--primary)\">%3$s</span>": "%1$s <b>%2$s</b> sera un <span style=\"color:var(--primary)\">%3$s</span>",
  "Saturday": "Samedi",
  "Sunday": "Dimanche",
  "Monday": "Lundi",
  "Tuesday": "Mardi",
  "Wednesday": "Mercredi",
  "Thursday": "Jeudi",
  "Friday": "Vendredi",
  "0": "۰",
  "1": "۱",
  "2": "۲",
  "3": "۳",
  "4": "۴",
  "5": "۵",
  "6": "۶",
  "7": "۷",
  "8": "۸",
  "9": "۹",
  "English": "Anglais",
  "Mandarin Chinese": "Chinois Mandarin",
  "Hindi": "Hindi",
  "Spanish": "Espagnol",
  "French": "Français",
  "Arabic": "Arabe",
  "Bengali (Bangla)": "Bengali (Bangla)",
  "Portuguese": "Portugais",
  "Russian": "Russe",
  "Urdu": "Ourdou",
  "Select Language": "Sélectionner la langue"
}
