{
  "Zeller's Congruence Calculator | Find Day of the Week for Any Date": "ज़ेलर का सर्वांगसमता कैलकुलेटर | किसी भी तारीख के लिए सप्ताह का दिन खोजें",
  "📅 Zeller's Congruence Day of the Week Calculator": "📅 ज़ेलर का सर्वांगसमता सप्ताह का दिन कैलकुलेटर",
  "Discover the exact day of the week for any date. Our tool uses Zeller's Congruence for precise calculations, including the complex Gregorian calendar transition of 1582.": "किसी भी तारीख के लिए सप्ताह का सटीक दिन खोजें। हमारा टूल 1582 के जटिल ग्रेगोरियन कैलेंडर संक्रमण सहित सटीक गणना के लिए ज़ेलर की सर्वांगसमता का उपयोग करता है।",
  "Find Day": "दिन खोजें",
  "🧮 Zeller’s Congruence Explained": "🧮 ज़ेलर की सर्वांगसमता समझाई गई",
  "<b>Zeller’s Congruence</b> is a brilliant mathematical formula used to determine the day of the week for any date. The version used here is optimized for the Gregorian calendar.": "<b>ज़ेलर की सर्वांगसमता</b> एक शानदार गणितीय सूत्र है जिसका उपयोग किसी भी तारीख के लिए सप्ताह के दिन का निर्धारण करने के लिए किया जाता है। यहां उपयोग किया गया संस्करण ग्रेगोरियन कैलेंडर के लिए अनुकूलित है।",
  "Or": "या",
  " = The day of the week (0 = Saturday, 1 = Sunday, ..., 6 = Friday)": " = सप्ताह का दिन (0 = शनिवार, 1 = रविवार, ..., 6 = शुक्रवार)",
  " = The day of the month": " = महीने का दिन",
  " = The month (3 = March, ..., 12 = December). For Jan &amp; Feb, m is 13 &amp; 14 of the <i>previous</i> year.": " = महीना (3 = मार्च, ..., 12 = दिसंबर)। जनवरी और फरवरी के लिए, m <i>पिछले</i> वर्ष का 13 और 14 है।",
  " = The year of the century (<code>year % 100</code>)": " = सदी का वर्ष (<code>वर्ष % 100</code>)",
  " = The zero-based century (<code>Math.floor(year / 100)</code>)": " = शून्य-आधारित सदी (<code>Math.floor(वर्ष / 100)</code>)",
  "Historical Adjustment Note:": "ऐतिहासिक समायोजन नोट:",
  "The Gregorian calendar was adopted in October 1582, which involved skipping 10 days (from October 5th to 14th) to realign the calendar with the seasons. This app correctly identifies these non-existent dates.": "ग्रेगोरियन कैलेंडर अक्टूबर 1582 में अपनाया गया था, जिसमें मौसमों के साथ कैलेंडर को फिर से संरेखित करने के लिए 10 दिन (5 से 14 अक्टूबर तक) छोड़ना शामिल था। यह ऐप इन गैर-मौजूद तारीखों की सही पहचान करता है।",
  "🤔 Frequently Asked Questions (FAQ)": "🤔 अक्सर पूछे जाने वाले प्रश्न (FAQ)",
  "What is Zeller’s Congruence?": "ज़ेलर की सर्वांगसमता क्या है?",
  "Zeller's Congruence is a mathematical algorithm developed by Christian Zeller to calculate the day of the week for any given date in the Gregorian or Julian calendars.": "ज़ेलर की सर्वांगसमता एक गणितीय एल्गोरिथ्म है जिसे क्रिश्चियन ज़ेलर ने ग्रेगोरियन या जूलियन कैलेंडर में किसी भी दी गई तारीख के लिए सप्ताह के दिन की गणना करने के लिए विकसित किया है।",
  "Why are January and February treated as months 13 and 14 of the previous year?": "जनवरी और फरवरी को पिछले वर्ष के 13वें और 14वें महीने के रूप में क्यों माना जाता है?",
  "This adjustment simplifies the leap year calculation. By treating January and February as the end of the previous year, the leap day (February 29th) is always the last day of the calculation year, which makes the formula consistent.": "यह समायोजन लीप वर्ष की गणना को सरल बनाता है। जनवरी और फरवरी को पिछले वर्ष के अंत के रूप में मानकर, लीप दिवस (29 फरवरी) हमेशा गणना वर्ष का अंतिम दिन होता है, जो सूत्र को सुसंगत बनाता है।",
  "Is this calculator accurate?": "क्या यह कैलकुलेटर सटीक है?",
  "Yes, this calculator is highly accurate for any date since the adoption of the Gregorian calendar (October 15, 1582). It correctly handles the 10-day skip implemented during the calendar reform.": "हाँ, यह कैलकुलेटर ग्रेगोरियन कैलेंडर (15 अक्टूबर, 1582) को अपनाने के बाद से किसी भी तारीख के लिए अत्यधिक सटीक है। यह कैलेंडर सुधार के दौरान लागू किए गए 10-दिवसीय स्किप को सही ढंग से संभालता है।",
  "Day Finder": "दिन खोजक",
  "Developed by Mamedul Islam": "ममेदुल इस्लाम द्वारा विकसित",
  "⚠️ Please select a valid date.": "⚠️ कृपया एक वैध तारीख चुनें।",
  "⚠️ These dates (Oct 5-14, 1582) do not exist due to the Gregorian calendar reform.": "⚠️ ये तारीखें (5-14 अक्टूबर, 1582) ग्रेगोरियन कैलेंडर सुधार के कारण मौजूद नहीं हैं।",
  "⚠️ This calculator is accurate for dates on or after October 15, 1582.": "⚠️ यह कैलकुलेटर 15 अक्टूबर, 1582 को या उसके बाद की तारीखों के लिए सटीक है।",
  "%1$s <b>%2$s</b> is a <span style=\"color:var(--primary)\">%3$s</span>": "%1$s <b>%2$s</b> एक <span style=\"color:var(--primary)\">%3$s</span> है",
  "%1$s <b>%2$s</b> was a <span style=\"color:var(--primary)\">%3$s</span>": "%1$s <b>%2$s</b> एक <span style=\"color:var(--primary)\">%3$s</span> था",
  "%1$s <b>%2$s</b> will be a <span style=\"color:var(--primary)\">%3$s</span>": "%1$s <b>%2$s</b> एक <span style=\"color:var(--primary)\">%3$s</span> होगा",
  "Saturday": "शनिवार",
  "Sunday": "रविवार",
  "Monday": "सोमवार",
  "Tuesday": "मंगलवार",
  "Wednesday": "बुधवार",
  "Thursday": "गुरुवार",
  "Friday": "शुक्रवार",
  "0": "०",
  "1": "१",
  "2": "२",
  "3": "३",
  "4": "४",
  "5": "५",
  "6": "६",
  "7": "७",
  "8": "८",
  "9": "९",
  "English": "अंग्रेज़ी",
  "Mandarin Chinese": "मंदारिन चीनी",
  "Hindi": "हिन्दी",
  "Spanish": "स्पेनिश",
  "French": "फ्रेंच",
  "Arabic": "अरबी",
  "Bengali (Bangla)": "बंगाली",
  "Portuguese": "पुर्तगाली",
  "Russian": "रूसी",
  "Urdu": "उर्दू",
  "Select Language": "भाषा चुनें"
}
