{
  "Zeller's Congruence Calculator | Find Day of the Week for Any Date": "Calculadora de Congruência de Zeller | Encontre o Dia da Semana para Qualquer Data",
  "📅 Zeller's Congruence Day of the Week Calculator": "📅 Calculadora do Dia da Semana por Congruência de Zeller",
  "Discover the exact day of the week for any date. Our tool uses Zeller's Congruence for precise calculations, including the complex Gregorian calendar transition of 1582.": "Descubra o dia exato da semana para qualquer data. Nossa ferramenta usa a Congruência de Zeller para cálculos precisos, incluindo a complexa transição do calendário gregoriano de 1582.",
  "Find Day": "Encontrar Dia",
  "🧮 Zeller’s Congruence Explained": "🧮 Explicação da Congruência de Zeller",
  "<b>Zeller’s Congruence</b> is a brilliant mathematical formula used to determine the day of the week for any date. The version used here is optimized for the Gregorian calendar.": "A <b>Congruência de Zeller</b> é uma fórmula matemática brilhante usada para determinar o dia da semana para qualquer data. A versão usada aqui é otimizada para o calendário gregoriano.",
  "Or": "Ou",
  " = The day of the week (0 = Saturday, 1 = Sunday, ..., 6 = Friday)": " = O dia da semana (0 = Sábado, 1 = Domingo, ..., 6 = Sexta-feira)",
  " = The day of the month": " = O dia do mês",
  " = The month (3 = March, ..., 12 = December). For Jan &amp; Feb, m is 13 &amp; 14 of the <i>previous</i> year.": " = O mês (3 = Março, ..., 12 = Dezembro). Para Jan & Fev, m é 13 & 14 do ano <i>anterior</i>.",
  " = The year of the century (<code>year % 100</code>)": " = O ano do século (<code>ano % 100</code>)",
  " = The zero-based century (<code>Math.floor(year / 100)</code>)": " = O século baseado em zero (<code>Math.floor(ano / 100)</code>)",
  "Historical Adjustment Note:": "Nota de Ajuste Histórico:",
  "The Gregorian calendar was adopted in October 1582, which involved skipping 10 days (from October 5th to 14th) to realign the calendar with the seasons. This app correctly identifies these non-existent dates.": "O calendário gregoriano foi adotado em outubro de 1582, o que envolveu pular 10 dias (de 5 a 14 de outubro) para realinhar o calendário com as estações. Este aplicativo identifica corretamente essas datas inexistentes.",
  "🤔 Frequently Asked Questions (FAQ)": "🤔 Perguntas Frequentes (FAQ)",
  "What is Zeller’s Congruence?": "O que é a Congruência de Zeller?",
  "Zeller's Congruence is a mathematical algorithm developed by Christian Zeller to calculate the day of the week for any given date in the Gregorian or Julian calendars.": "A Congruência de Zeller é um algoritmo matemático desenvolvido por Christian Zeller para calcular o dia da semana para qualquer data nos calendários gregoriano ou juliano.",
  "Why are January and February treated as months 13 and 14 of the previous year?": "Por que janeiro e fevereiro são tratados como os meses 13 e 14 do ano anterior?",
  "This adjustment simplifies the leap year calculation. By treating January and February as the end of the previous year, the leap day (February 29th) is always the last day of the calculation year, which makes the formula consistent.": "Este ajuste simplifica o cálculo do ano bissexto. Ao tratar janeiro e fevereiro como o final do ano anterior, o dia bissexto (29 de fevereiro) é sempre o último dia do ano de cálculo, o que torna a fórmula consistente.",
  "Is this calculator accurate?": "Esta calculadora é precisa?",
  "Yes, this calculator is highly accurate for any date since the adoption of the Gregorian calendar (October 15, 1582). It correctly handles the 10-day skip implemented during the calendar reform.": "Sim, esta calculadora é altamente precisa para qualquer data desde a adoção do calendário gregoriano (15 de outubro de 1582). Ela lida corretamente com o salto de 10 dias implementado durante a reforma do calendário.",
  "Day Finder": "Localizador de Dias",
  "Developed by Mamedul Islam": "Desenvolvido por Mamedul Islam",
  "⚠️ Please select a valid date.": "⚠️ Por favor, selecione uma data válida.",
  "⚠️ These dates (Oct 5-14, 1582) do not exist due to the Gregorian calendar reform.": "⚠️ Estas datas (5 a 14 de outubro de 1582) não existem devido à reforma do calendário gregoriano.",
  "⚠️ This calculator is accurate for dates on or after October 15, 1582.": "⚠️ Esta calculadora é precisa para datas a partir de 15 de outubro de 1582.",
  "%1$s <b>%2$s</b> is a <span style=\"color:var(--primary)\">%3$s</span>": "%1$s <b>%2$s</b> é <span style=\"color:var(--primary)\">%3$s</span>",
  "%1$s <b>%2$s</b> was a <span style=\"color:var(--primary)\">%3$s</span>": "%1$s <b>%2$s</b> foi <span style=\"color:var(--primary)\">%3$s</span>",
  "%1$s <b>%2$s</b> will be a <span style=\"color:var(--primary)\">%3$s</span>": "%1$s <b>%2$s</b> será <span style=\"color:var(--primary)\">%3$s</span>",
  "Saturday": "Sábado",
  "Sunday": "Domingo",
  "Monday": "Segunda-feira",
  "Tuesday": "Terça-feira",
  "Wednesday": "Quarta-feira",
  "Thursday": "Quinta-feira",
  "Friday": "Sexta-feira",
  "0": "۰",
  "1": "۱",
  "2": "۲",
  "3": "۳",
  "4": "۴",
  "5": "۵",
  "6": "۶",
  "7": "۷",
  "8": "۸",
  "9": "۹",
  "English": "Inglês",
  "Mandarin Chinese": "Chinês Mandarim",
  "Hindi": "Hindi",
  "Spanish": "Espanhol",
  "French": "Francês",
  "Arabic": "Árabe",
  "Bengali (Bangla)": "Bengali (Bangla)",
  "Portuguese": "Português",
  "Russian": "Russo",
  "Urdu": "Urdu",
  "Select Language": "Selecione o Idioma"
}
